land-boards/RasPi/RPI_PSOC5/RPI_PSOC5_RPI_SPI8_CARD_TEST.cydsn/Generated_Source/PSoC5/I2C1.h
/*******************************************************************************
* File Name: I2C1.h
* Version 3.50
*
* Description:
*  This file provides constants and parameter values for the I2C component.

*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_I2C_I2C1_H)
#define CY_I2C_I2C1_H

#include "cyfitter.h"
#include "cytypes.h"
#include "CyLib.h"

/* Check if required defines such as CY_PSOC5LP are available in cy_boot */
#if !defined (CY_PSOC5LP)
    #error Component I2C_v3_50 requires cy_boot v3.10 or later
#endif /* (CY_PSOC5LP) */


/***************************************
*   Conditional Compilation Parameters
****************************************/

#define I2C1_IMPLEMENTATION     (0u)
#define I2C1_MODE               (2u)
#define I2C1_ENABLE_WAKEUP      (0u)
#define I2C1_ADDR_DECODE        (1u)
#define I2C1_UDB_INTRN_CLOCK    (0u)


/* I2C implementation enum */
#define I2C1_UDB    (0x00u)
#define I2C1_FF     (0x01u)

#define I2C1_FF_IMPLEMENTED     (I2C1_FF  == I2C1_IMPLEMENTATION)
#define I2C1_UDB_IMPLEMENTED    (I2C1_UDB == I2C1_IMPLEMENTATION)

#define I2C1_UDB_INTRN_CLOCK_ENABLED    (I2C1_UDB_IMPLEMENTED && \
                                                     (0u != I2C1_UDB_INTRN_CLOCK))
/* I2C modes enum */
#define I2C1_MODE_SLAVE                 (0x01u)
#define I2C1_MODE_MASTER                (0x02u)
#define I2C1_MODE_MULTI_MASTER          (0x06u)
#define I2C1_MODE_MULTI_MASTER_SLAVE    (0x07u)
#define I2C1_MODE_MULTI_MASTER_MASK     (0x04u)

#define I2C1_MODE_SLAVE_ENABLED         (0u != (I2C1_MODE_SLAVE  & I2C1_MODE))
#define I2C1_MODE_MASTER_ENABLED        (0u != (I2C1_MODE_MASTER & I2C1_MODE))
#define I2C1_MODE_MULTI_MASTER_ENABLED  (0u != (I2C1_MODE_MULTI_MASTER_MASK & \
                                                            I2C1_MODE))
#define I2C1_MODE_MULTI_MASTER_SLAVE_ENABLED    (I2C1_MODE_MULTI_MASTER_SLAVE == \
                                                             I2C1_MODE)

/* Address detection enum */
#define I2C1_SW_DECODE      (0x00u)
#define I2C1_HW_DECODE      (0x01u)

#define I2C1_SW_ADRR_DECODE             (I2C1_SW_DECODE == I2C1_ADDR_DECODE)
#define I2C1_HW_ADRR_DECODE             (I2C1_HW_DECODE == I2C1_ADDR_DECODE)

/* Wakeup enabled */
#define I2C1_WAKEUP_ENABLED             (0u != I2C1_ENABLE_WAKEUP)

/* Adds bootloader APIs to component */
#define I2C1_BOOTLOADER_INTERFACE_ENABLED   (I2C1_MODE_SLAVE_ENABLED && \
                                                            ((CYDEV_BOOTLOADER_IO_COMP == CyBtldr_I2C1) || \
                                                             (CYDEV_BOOTLOADER_IO_COMP == CyBtldr_Custom_Interface)))

/* Timeout functionality */
#define I2C1_TIMEOUT_ENABLE             (0u)
#define I2C1_TIMEOUT_SCL_TMOUT_ENABLE   (0u)
#define I2C1_TIMEOUT_SDA_TMOUT_ENABLE   (0u)
#define I2C1_TIMEOUT_PRESCALER_ENABLE   (0u)
#define I2C1_TIMEOUT_IMPLEMENTATION     (0u)

/* Convert to boolean */
#define I2C1_TIMEOUT_ENABLED            (0u != I2C1_TIMEOUT_ENABLE)
#define I2C1_TIMEOUT_SCL_TMOUT_ENABLED  (0u != I2C1_TIMEOUT_SCL_TMOUT_ENABLE)
#define I2C1_TIMEOUT_SDA_TMOUT_ENABLED  (0u != I2C1_TIMEOUT_SDA_TMOUT_ENABLE)
#define I2C1_TIMEOUT_PRESCALER_ENABLED  (0u != I2C1_TIMEOUT_PRESCALER_ENABLE)

/* Timeout implementation enum. */
#define I2C1_TIMEOUT_UDB    (0x00u)
#define I2C1_TIMEOUT_FF     (0x01u)

#define I2C1_TIMEOUT_FF_IMPLEMENTED     (I2C1_TIMEOUT_FF  == \
                                                        I2C1_TIMEOUT_IMPLEMENTATION)
#define I2C1_TIMEOUT_UDB_IMPLEMENTED    (I2C1_TIMEOUT_UDB == \
                                                        I2C1_TIMEOUT_IMPLEMENTATION)

#define I2C1_TIMEOUT_FF_ENABLED         (I2C1_TIMEOUT_ENABLED && \
                                                     I2C1_TIMEOUT_FF_IMPLEMENTED)

#define I2C1_TIMEOUT_UDB_ENABLED        (I2C1_TIMEOUT_ENABLED && \
                                                     I2C1_TIMEOUT_UDB_IMPLEMENTED)

#define I2C1_EXTERN_I2C_INTR_HANDLER    (0u)
#define I2C1_EXTERN_TMOUT_INTR_HANDLER  (0u)

#define I2C1_INTERN_I2C_INTR_HANDLER    (0u == I2C1_EXTERN_I2C_INTR_HANDLER)
#define I2C1_INTERN_TMOUT_INTR_HANDLER  (0u == I2C1_EXTERN_TMOUT_INTR_HANDLER)


/***************************************
*       Type defines
***************************************/

/* Structure to save registers before go to sleep */
typedef struct
{
    uint8 enableState;

#if (I2C1_FF_IMPLEMENTED)
    uint8 xcfg;
    uint8 cfg;
    uint8 addr;
    uint8 clkDiv1;
    uint8 clkDiv2;
#else
    uint8 control;
#endif /* (I2C1_FF_IMPLEMENTED) */

#if (I2C1_TIMEOUT_ENABLED)
    uint16 tmoutCfg;
    uint8  tmoutIntr;
#endif /* (I2C1_TIMEOUT_ENABLED) */

} I2C1_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

void I2C1_Init(void)                            ;
void I2C1_Enable(void)                          ;

void I2C1_Start(void)                           ;
void I2C1_Stop(void)                            ;

#define I2C1_EnableInt()        CyIntEnable      (I2C1_ISR_NUMBER)
#define I2C1_DisableInt()       CyIntDisable     (I2C1_ISR_NUMBER)
#define I2C1_ClearPendingInt()  CyIntClearPending(I2C1_ISR_NUMBER)
#define I2C1_SetPendingInt()    CyIntSetPending  (I2C1_ISR_NUMBER)

void I2C1_SaveConfig(void)                      ;
void I2C1_Sleep(void)                           ;
void I2C1_RestoreConfig(void)                   ;
void I2C1_Wakeup(void)                          ;

/* I2C Master functions prototypes */
#if (I2C1_MODE_MASTER_ENABLED)
    /* Read and Clear status functions */
    uint8 I2C1_MasterStatus(void)                ;
    uint8 I2C1_MasterClearStatus(void)           ;

    /* Interrupt based operation functions */
    uint8 I2C1_MasterWriteBuf(uint8 slaveAddress, uint8 * wrData, uint8 cnt, uint8 mode) \
                                                            ;
    uint8 I2C1_MasterReadBuf(uint8 slaveAddress, uint8 * rdData, uint8 cnt, uint8 mode) \
                                                            ;
    uint8 I2C1_MasterGetReadBufSize(void)       ;
    uint8 I2C1_MasterGetWriteBufSize(void)      ;
    void  I2C1_MasterClearReadBuf(void)         ;
    void  I2C1_MasterClearWriteBuf(void)        ;

    /* Manual operation functions */
    uint8 I2C1_MasterSendStart(uint8 slaveAddress, uint8 R_nW) \
                                                            ;
    uint8 I2C1_MasterSendRestart(uint8 slaveAddress, uint8 R_nW) \
                                                            ;
    uint8 I2C1_MasterSendStop(void)             ;
    uint8 I2C1_MasterWriteByte(uint8 theByte)   ;
    uint8 I2C1_MasterReadByte(uint8 acknNak)    ;

