land-boards/RasPi/RPI_PSOC5/RPI_PSOC5_RPI_SPI8_CARD_TEST.cydsn/Generated_Source/PSoC5/I2C1.h
    #define I2C1_SSTAT_RD_CLEAR     (0x0Du) /* Read Status clear */
    #define I2C1_SSTAT_WR_CLEAR     (0xD0u) /* Write Status Clear */

#endif /* (I2C1_MODE_SLAVE_ENABLED) */


/***************************************
*       I2C state machine constants
***************************************/

/* Default slave address states */
#define  I2C1_SM_IDLE           (0x10u) /* Default state - IDLE */
#define  I2C1_SM_EXIT_IDLE      (0x00u) /* Pass master and slave processing and go to IDLE */

/* Slave mode states */
#define  I2C1_SM_SLAVE          (I2C1_SM_IDLE) /* Any Slave state */
#define  I2C1_SM_SL_WR_DATA     (0x11u) /* Master writes data to slave  */
#define  I2C1_SM_SL_RD_DATA     (0x12u) /* Master reads data from slave */

/* Master mode states */
#define  I2C1_SM_MASTER         (0x40u) /* Any master state */

#define  I2C1_SM_MSTR_RD        (0x08u) /* Any master read state          */
#define  I2C1_SM_MSTR_RD_ADDR   (0x49u) /* Master sends address with read */
#define  I2C1_SM_MSTR_RD_DATA   (0x4Au) /* Master reads data              */

#define  I2C1_SM_MSTR_WR        (0x04u) /* Any master read state           */
#define  I2C1_SM_MSTR_WR_ADDR   (0x45u) /* Master sends address with write */
#define  I2C1_SM_MSTR_WR_DATA   (0x46u) /* Master writes data              */

#define  I2C1_SM_MSTR_HALT      (0x60u) /* Master waits for ReStart */

#define I2C1_CHECK_SM_MASTER    (0u != (I2C1_SM_MASTER & I2C1_state))
#define I2C1_CHECK_SM_SLAVE     (0u != (I2C1_SM_SLAVE  & I2C1_state))


/***************************************
*              Registers
***************************************/

#if (I2C1_FF_IMPLEMENTED)
    /* Fixed Function registers */
    #define I2C1_XCFG_REG           (*(reg8 *) I2C1_I2C_FF__XCFG)
    #define I2C1_XCFG_PTR           ( (reg8 *) I2C1_I2C_FF__XCFG)

    #define I2C1_ADDR_REG           (*(reg8 *) I2C1_I2C_FF__ADR)
    #define I2C1_ADDR_PTR           ( (reg8 *) I2C1_I2C_FF__ADR)

    #define I2C1_CFG_REG            (*(reg8 *) I2C1_I2C_FF__CFG)
    #define I2C1_CFG_PTR            ( (reg8 *) I2C1_I2C_FF__CFG)

    #define I2C1_CSR_REG            (*(reg8 *) I2C1_I2C_FF__CSR)
    #define I2C1_CSR_PTR            ( (reg8 *) I2C1_I2C_FF__CSR)

    #define I2C1_DATA_REG           (*(reg8 *) I2C1_I2C_FF__D)
    #define I2C1_DATA_PTR           ( (reg8 *) I2C1_I2C_FF__D)

    #define I2C1_MCSR_REG           (*(reg8 *) I2C1_I2C_FF__MCSR)
    #define I2C1_MCSR_PTR           ( (reg8 *) I2C1_I2C_FF__MCSR)

    #define I2C1_ACT_PWRMGR_REG     (*(reg8 *) I2C1_I2C_FF__PM_ACT_CFG)
    #define I2C1_ACT_PWRMGR_PTR     ( (reg8 *) I2C1_I2C_FF__PM_ACT_CFG)
    #define I2C1_ACT_PWR_EN         ( (uint8)  I2C1_I2C_FF__PM_ACT_MSK)

    #define I2C1_STBY_PWRMGR_REG    (*(reg8 *) I2C1_I2C_FF__PM_STBY_CFG)
    #define I2C1_STBY_PWRMGR_PTR    ( (reg8 *) I2C1_I2C_FF__PM_STBY_CFG)
    #define I2C1_STBY_PWR_EN        ( (uint8)  I2C1_I2C_FF__PM_STBY_MSK)

    #define I2C1_PWRSYS_CR1_REG     (*(reg8 *) CYREG_PWRSYS_CR1)
    #define I2C1_PWRSYS_CR1_PTR     ( (reg8 *) CYREG_PWRSYS_CR1)

    #define I2C1_CLKDIV1_REG    (*(reg8 *) I2C1_I2C_FF__CLK_DIV1)
    #define I2C1_CLKDIV1_PTR    ( (reg8 *) I2C1_I2C_FF__CLK_DIV1)

    #define I2C1_CLKDIV2_REG    (*(reg8 *) I2C1_I2C_FF__CLK_DIV2)
    #define I2C1_CLKDIV2_PTR    ( (reg8 *) I2C1_I2C_FF__CLK_DIV2)

#else
    /* UDB implementation registers */
    #define I2C1_CFG_REG \
            (*(reg8 *) I2C1_bI2C_UDB_SyncCtl_CtrlReg__CONTROL_REG)
    #define I2C1_CFG_PTR \
            ( (reg8 *) I2C1_bI2C_UDB_SyncCtl_CtrlReg__CONTROL_REG)

    #define I2C1_CSR_REG        (*(reg8 *) I2C1_bI2C_UDB_StsReg__STATUS_REG)
    #define I2C1_CSR_PTR        ( (reg8 *) I2C1_bI2C_UDB_StsReg__STATUS_REG)

    #define I2C1_INT_MASK_REG   (*(reg8 *) I2C1_bI2C_UDB_StsReg__MASK_REG)
    #define I2C1_INT_MASK_PTR   ( (reg8 *) I2C1_bI2C_UDB_StsReg__MASK_REG)

    #define I2C1_INT_ENABLE_REG (*(reg8 *) I2C1_bI2C_UDB_StsReg__STATUS_AUX_CTL_REG)
    #define I2C1_INT_ENABLE_PTR ( (reg8 *) I2C1_bI2C_UDB_StsReg__STATUS_AUX_CTL_REG)

    #define I2C1_DATA_REG       (*(reg8 *) I2C1_bI2C_UDB_Shifter_u0__A0_REG)
    #define I2C1_DATA_PTR       ( (reg8 *) I2C1_bI2C_UDB_Shifter_u0__A0_REG)

    #define I2C1_GO_REG         (*(reg8 *) I2C1_bI2C_UDB_Shifter_u0__F1_REG)
    #define I2C1_GO_PTR         ( (reg8 *) I2C1_bI2C_UDB_Shifter_u0__F1_REG)

    #define I2C1_GO_DONE_REG    (*(reg8 *) I2C1_bI2C_UDB_Shifter_u0__A1_REG)
    #define I2C1_GO_DONE_PTR    ( (reg8 *) I2C1_bI2C_UDB_Shifter_u0__A1_REG)

    #define I2C1_MCLK_PRD_REG   (*(reg8 *) I2C1_bI2C_UDB_Master_ClkGen_u0__D0_REG)
    #define I2C1_MCLK_PRD_PTR   ( (reg8 *) I2C1_bI2C_UDB_Master_ClkGen_u0__D0_REG)

    #define I2C1_MCLK_CMP_REG   (*(reg8 *) I2C1_bI2C_UDB_Master_ClkGen_u0__D1_REG)
    #define I2C1_MCLK_CMP_PTR   ( (reg8 *) I2C1_bI2C_UDB_Master_ClkGen_u0__D1_REG)

    #if (I2C1_MODE_SLAVE_ENABLED)
        #define I2C1_ADDR_REG       (*(reg8 *) I2C1_bI2C_UDB_Shifter_u0__D0_REG)
        #define I2C1_ADDR_PTR       ( (reg8 *) I2C1_bI2C_UDB_Shifter_u0__D0_REG)

        #define I2C1_PERIOD_REG     (*(reg8 *) I2C1_bI2C_UDB_Slave_BitCounter__PERIOD_REG)
        #define I2C1_PERIOD_PTR     ( (reg8 *) I2C1_bI2C_UDB_Slave_BitCounter__PERIOD_REG)

        #define I2C1_COUNTER_REG    (*(reg8 *) I2C1_bI2C_UDB_Slave_BitCounter__COUNT_REG)
        #define I2C1_COUNTER_PTR    ( (reg8 *) I2C1_bI2C_UDB_Slave_BitCounter__COUNT_REG)

        #define I2C1_COUNTER_AUX_CTL_REG \
                                    (*(reg8 *) I2C1_bI2C_UDB_Slave_BitCounter__CONTROL_AUX_CTL_REG)
        #define I2C1_COUNTER_AUX_CTL_PTR \
                                    ( (reg8 *) I2C1_bI2C_UDB_Slave_BitCounter__CONTROL_AUX_CTL_REG)

    #endif /* (I2C1_MODE_SLAVE_ENABLED) */

#endif /* (I2C1_FF_IMPLEMENTED) */


/***************************************
*        Registers Constants
***************************************/

/* I2C1_I2C_IRQ */
#define I2C1_ISR_NUMBER     ((uint8) I2C1_I2C_IRQ__INTC_NUMBER)
#define I2C1_ISR_PRIORITY   ((uint8) I2C1_I2C_IRQ__INTC_PRIOR_NUM)

