land-boards/RasPi/RPI_PSOC5/RPI_PSOC5_RPI_SPI8_CARD_TEST.cydsn/Generated_Source/PSoC5/I2C1.h
/***************************************
*        Marco
***************************************/

/* ACK and NACK for data and address checks */
#define I2C1_CHECK_ADDR_ACK(csr)    ((I2C1_CSR_LRB_ACK | I2C1_CSR_ADDRESS) == \
                                                 ((I2C1_CSR_LRB    | I2C1_CSR_ADDRESS) &  \
                                                  (csr)))


#define I2C1_CHECK_ADDR_NAK(csr)    ((I2C1_CSR_LRB_NAK | I2C1_CSR_ADDRESS) == \
                                                 ((I2C1_CSR_LRB    | I2C1_CSR_ADDRESS) &  \
                                                  (csr)))

#define I2C1_CHECK_DATA_ACK(csr)    (0u == ((csr) & I2C1_CSR_LRB_NAK))

/* MCSR conditions check */
#define I2C1_CHECK_BUS_FREE(mcsr)       (0u == ((mcsr) & I2C1_MCSR_BUS_BUSY))
#define I2C1_CHECK_MASTER_MODE(mcsr)    (0u != ((mcsr) & I2C1_MCSR_MSTR_MODE))

/* CSR conditions check */
#define I2C1_WAIT_BYTE_COMPLETE(csr)    (0u == ((csr) & I2C1_CSR_BYTE_COMPLETE))
#define I2C1_WAIT_STOP_COMPLETE(csr)    (0u == ((csr) & (I2C1_CSR_BYTE_COMPLETE | \
                                                                     I2C1_CSR_STOP_STATUS)))
#define I2C1_CHECK_BYTE_COMPLETE(csr)   (0u != ((csr) & I2C1_CSR_BYTE_COMPLETE))
#define I2C1_CHECK_STOP_STS(csr)        (0u != ((csr) & I2C1_CSR_STOP_STATUS))
#define I2C1_CHECK_LOST_ARB(csr)        (0u != ((csr) & I2C1_CSR_LOST_ARB))
#define I2C1_CHECK_ADDRESS_STS(csr)     (0u != ((csr) & I2C1_CSR_ADDRESS))

/* Software start and end of transaction check */
#define I2C1_CHECK_RESTART(mstrCtrl)    (0u != ((mstrCtrl) & I2C1_MODE_REPEAT_START))
#define I2C1_CHECK_NO_STOP(mstrCtrl)    (0u != ((mstrCtrl) & I2C1_MODE_NO_STOP))

/* Send read or write completion depends on state */
#define I2C1_GET_MSTAT_CMPLT ((0u != (I2C1_state & I2C1_SM_MSTR_RD)) ? \
                                                 (I2C1_MSTAT_RD_CMPLT) : (I2C1_MSTAT_WR_CMPLT))

/* Returns 7-bit slave address */
#define I2C1_GET_SLAVE_ADDR(dataReg)   (((dataReg) >> I2C1_SLAVE_ADDR_SHIFT) & \
                                                                  I2C1_SLAVE_ADDR_MASK)

#if (I2C1_FF_IMPLEMENTED)
    /* Check enable of module */
    #define I2C1_I2C_ENABLE_REG     (I2C1_ACT_PWRMGR_REG)
    #define I2C1_IS_I2C_ENABLE(reg) (0u != ((reg) & I2C1_ACT_PWR_EN))
    #define I2C1_IS_ENABLED         (0u != (I2C1_ACT_PWRMGR_REG & I2C1_ACT_PWR_EN))

    #define I2C1_CHECK_PWRSYS_I2C_BACKUP    (0u != (I2C1_PWRSYS_CR1_I2C_REG_BACKUP & \
                                                                I2C1_PWRSYS_CR1_REG))

    /* Check start condition generation */
    #define I2C1_CHECK_START_GEN(mcsr)  ((0u != ((mcsr) & I2C1_MCSR_START_GEN)) && \
                                                     (0u == ((mcsr) & I2C1_MCSR_MSTR_MODE)))

    #define I2C1_CLEAR_START_GEN        do{ \
                                                        I2C1_MCSR_REG &=                                   \
                                                                           ((uint8) ~I2C1_MCSR_START_GEN); \
                                                    }while(0)

    /* Stop interrupt */
    #define I2C1_ENABLE_INT_ON_STOP     do{ \
                                                        I2C1_CFG_REG |= I2C1_CFG_STOP_IE; \
                                                    }while(0)

    #define I2C1_DISABLE_INT_ON_STOP    do{ \
                                                        I2C1_CFG_REG &=                                 \
                                                                           ((uint8) ~I2C1_CFG_STOP_IE); \
                                                    }while(0)

    /* Transmit data */
    #define I2C1_TRANSMIT_DATA          do{ \
                                                        I2C1_CSR_REG = I2C1_CSR_TRANSMIT; \
                                                    }while(0)

    #define I2C1_ACK_AND_TRANSMIT       do{ \
                                                        I2C1_CSR_REG = (I2C1_CSR_ACK |      \
                                                                                    I2C1_CSR_TRANSMIT); \
                                                    }while(0)

    #define I2C1_NAK_AND_TRANSMIT       do{ \
                                                        I2C1_CSR_REG = I2C1_CSR_NAK; \
                                                    }while(0)

    /* Special case: udb needs to ack, ff needs to nak */
    #define I2C1_ACKNAK_AND_TRANSMIT    do{ \
                                                        I2C1_CSR_REG  = (I2C1_CSR_NAK |      \
                                                                                     I2C1_CSR_TRANSMIT); \
                                                    }while(0)
    /* Receive data */
    #define I2C1_ACK_AND_RECEIVE        do{ \
                                                        I2C1_CSR_REG = I2C1_CSR_ACK; \
                                                    }while(0)

    #define I2C1_NAK_AND_RECEIVE        do{ \
                                                        I2C1_CSR_REG = I2C1_CSR_NAK; \
                                                    }while(0)

    #define I2C1_READY_TO_READ          do{ \
                                                        I2C1_CSR_REG = I2C1_CSR_RDY_TO_RD; \
                                                    }while(0)

    /* Release bus after lost arbitration */
    #define I2C1_BUS_RELEASE    I2C1_READY_TO_READ

    /* Master Start/ReStart/Stop conditions generation */
    #define I2C1_GENERATE_START         do{ \
                                                        I2C1_MCSR_REG = I2C1_MCSR_START_GEN; \
                                                    }while(0)

    #define I2C1_GENERATE_RESTART \
                    do{                       \
                        I2C1_MCSR_REG = (I2C1_MCSR_RESTART_GEN | \
                                                     I2C1_MCSR_STOP_GEN);    \
                        I2C1_CSR_REG  = I2C1_CSR_TRANSMIT;       \
                    }while(0)

    #define I2C1_GENERATE_STOP \
                    do{                    \
                        I2C1_MCSR_REG = I2C1_MCSR_STOP_GEN; \
                        I2C1_CSR_REG  = I2C1_CSR_TRANSMIT;  \
                    }while(0)

    /* Master manual APIs compatible defines */
    #define I2C1_GENERATE_START_MANUAL      I2C1_GENERATE_START
    #define I2C1_GENERATE_RESTART_MANUAL    I2C1_GENERATE_RESTART
    #define I2C1_GENERATE_STOP_MANUAL       I2C1_GENERATE_STOP
    #define I2C1_TRANSMIT_DATA_MANUAL       I2C1_TRANSMIT_DATA
    #define I2C1_READY_TO_READ_MANUAL       I2C1_READY_TO_READ
    #define I2C1_ACK_AND_RECEIVE_MANUAL     I2C1_ACK_AND_RECEIVE
    #define I2C1_BUS_RELEASE_MANUAL         I2C1_BUS_RELEASE

#else

    /* Masks to enable interrupts from Status register */
    #define I2C1_STOP_IE_MASK           (I2C1_STS_STOP_MASK)
    #define I2C1_BYTE_COMPLETE_IE_MASK  (I2C1_STS_BYTE_COMPLETE_MASK)

    /* FF compatibility: CSR register bit-fields */
    #define I2C1_CSR_LOST_ARB       (I2C1_STS_LOST_ARB_MASK)
    #define I2C1_CSR_STOP_STATUS    (I2C1_STS_STOP_MASK)
    #define I2C1_CSR_BUS_ERROR      (0x00u)
    #define I2C1_CSR_ADDRESS        (I2C1_STS_ADDR_MASK)
    #define I2C1_CSR_TRANSMIT       (I2C1_CTRL_TRANSMIT_MASK)
    #define I2C1_CSR_LRB            (I2C1_STS_LRB_MASK)
    #define I2C1_CSR_LRB_NAK        (I2C1_STS_LRB_MASK)
    #define I2C1_CSR_LRB_ACK        (0x00u)
    #define I2C1_CSR_BYTE_COMPLETE  (I2C1_STS_BYTE_COMPLETE_MASK)

    /* FF compatibility: MCSR registers bit-fields */
    #define I2C1_MCSR_REG           (I2C1_CSR_REG)  /* UDB incorporates master and slave regs */
    #define I2C1_MCSR_BUS_BUSY      (I2C1_STS_BUSY_MASK)      /* Is bus is busy               */
    #define I2C1_MCSR_START_GEN     (I2C1_CTRL_START_MASK)    /* Generate Start condition     */
    #define I2C1_MCSR_RESTART_GEN   (I2C1_CTRL_RESTART_MASK)  /* Generates RESTART condition  */
    #define I2C1_MCSR_MSTR_MODE     (I2C1_STS_MASTER_MODE_MASK)/* Define if active Master     */

    /* Data to write into TX FIFO to release FSM */
    #define I2C1_PREPARE_TO_RELEASE (0xFFu)
    #define I2C1_RELEASE_FSM        (0x00u)

