land-boards/RasPi/RPI_PSOC5/RPI_PSOC5_RPI_SPI8_CARD_TEST.cydsn/Generated_Source/PSoC5/I2C1.h
    /* Define release command done: history of byte complete status is cleared */
    #define I2C1_WAIT_RELEASE_CMD_DONE  (I2C1_RELEASE_FSM != I2C1_GO_DONE_REG)

    /* Check enable of module */
    #define I2C1_I2C_ENABLE_REG     (I2C1_CFG_REG)
    #define I2C1_IS_I2C_ENABLE(reg) ((0u != ((reg) & I2C1_ENABLE_MASTER)) || \
                                                 (0u != ((reg) & I2C1_ENABLE_SLAVE)))

    #define I2C1_IS_ENABLED         (0u != (I2C1_CFG_REG & I2C1_ENABLE_MS))

    /* Check start condition generation */
    #define I2C1_CHECK_START_GEN(mcsr)  ((0u != (I2C1_CFG_REG &        \
                                                             I2C1_MCSR_START_GEN)) \
                                                    &&                                         \
                                                    (0u == ((mcsr) & I2C1_MCSR_MSTR_MODE)))

    #define I2C1_CLEAR_START_GEN        do{ \
                                                        I2C1_CFG_REG &=                 \
                                                        ((uint8) ~I2C1_MCSR_START_GEN); \
                                                    }while(0)

    /* Stop interrupt */
    #define I2C1_ENABLE_INT_ON_STOP     do{ \
                                                       I2C1_INT_MASK_REG |= I2C1_STOP_IE_MASK; \
                                                    }while(0)

    #define I2C1_DISABLE_INT_ON_STOP    do{ \
                                                        I2C1_INT_MASK_REG &=                               \
                                                                             ((uint8) ~I2C1_STOP_IE_MASK); \
                                                    }while(0)

    /* Transmit data */
    #define I2C1_TRANSMIT_DATA \
                                    do{    \
                                        I2C1_CFG_REG     = (I2C1_CTRL_TRANSMIT_MASK | \
                                                                       I2C1_CTRL_DEFAULT);        \
                                        I2C1_GO_DONE_REG = I2C1_PREPARE_TO_RELEASE;   \
                                        I2C1_GO_REG      = I2C1_RELEASE_FSM;          \
                                    }while(0)

    #define I2C1_ACK_AND_TRANSMIT   I2C1_TRANSMIT_DATA

    #define I2C1_NAK_AND_TRANSMIT \
                                        do{   \
                                            I2C1_CFG_REG     = (I2C1_CTRL_NACK_MASK     | \
                                                                            I2C1_CTRL_TRANSMIT_MASK | \
                                                                            I2C1_CTRL_DEFAULT);       \
                                            I2C1_GO_DONE_REG = I2C1_PREPARE_TO_RELEASE;   \
                                            I2C1_GO_REG      = I2C1_RELEASE_FSM;          \
                                        }while(0)

    /* Receive data */
    #define I2C1_READY_TO_READ  \
                                        do{ \
                                            I2C1_CFG_REG     = I2C1_CTRL_DEFAULT;       \
                                            I2C1_GO_DONE_REG = I2C1_PREPARE_TO_RELEASE; \
                                            I2C1_GO_REG      = I2C1_RELEASE_FSM;       \
                                        }while(0)

    #define I2C1_ACK_AND_RECEIVE    I2C1_READY_TO_READ

    /* Release bus after arbitration is lost */
    #define I2C1_BUS_RELEASE    I2C1_READY_TO_READ

    #define I2C1_NAK_AND_RECEIVE \
                                        do{  \
                                            I2C1_CFG_REG     = (I2C1_CTRL_NACK_MASK |   \
                                                                            I2C1_CTRL_DEFAULT);     \
                                            I2C1_GO_DONE_REG = I2C1_PREPARE_TO_RELEASE; \
                                            I2C1_GO_REG      = I2C1_RELEASE_FSM;       \
                                        }while(0)

    /* Master condition generation */
    #define I2C1_GENERATE_START \
                                        do{ \
                                            I2C1_CFG_REG     = (I2C1_CTRL_START_MASK |  \
                                                                            I2C1_CTRL_DEFAULT);     \
                                            I2C1_GO_DONE_REG = I2C1_PREPARE_TO_RELEASE; \
                                            I2C1_GO_REG      = I2C1_RELEASE_FSM;       \
                                        }while(0)

    #define I2C1_GENERATE_RESTART \
                                        do{   \
                                            I2C1_CFG_REG     = (I2C1_CTRL_RESTART_MASK | \
                                                                            I2C1_CTRL_NACK_MASK    | \
                                                                            I2C1_CTRL_DEFAULT);      \
                                            I2C1_GO_DONE_REG = I2C1_PREPARE_TO_RELEASE;  \
                                            I2C1_GO_REG  =     I2C1_RELEASE_FSM;         \
                                        }while(0)

    #define I2C1_GENERATE_STOP  \
                                        do{ \
                                            I2C1_CFG_REG    = (I2C1_CTRL_NACK_MASK |    \
                                                                           I2C1_CTRL_STOP_MASK |    \
                                                                           I2C1_CTRL_DEFAULT);      \
                                            I2C1_GO_DONE_REG = I2C1_PREPARE_TO_RELEASE; \
                                            I2C1_GO_REG      = I2C1_RELEASE_FSM;        \
                                        }while(0)

    /* Master manual APIs compatible macros */
    /* These macros wait until byte complete history is cleared after command issued */
    #define I2C1_GENERATE_START_MANUAL \
                                        do{ \
                                            I2C1_GENERATE_START;                  \
                                            /* Wait until byte complete history is cleared */ \
                                            while(I2C1_WAIT_RELEASE_CMD_DONE)     \
                                            {                                                 \
                                            }                                                 \
                                        }while(0)
                                        
    #define I2C1_GENERATE_RESTART_MANUAL \
                                        do{          \
                                            I2C1_GENERATE_RESTART;                \
                                            /* Wait until byte complete history is cleared */ \
                                            while(I2C1_WAIT_RELEASE_CMD_DONE)     \
                                            {                                                 \
                                            }                                                 \
                                        }while(0)

    #define I2C1_GENERATE_STOP_MANUAL \
                                        do{       \
                                            I2C1_GENERATE_STOP;                   \
                                            /* Wait until byte complete history is cleared */ \
                                            while(I2C1_WAIT_RELEASE_CMD_DONE)     \
                                            {                                                 \
                                            }                                                 \
                                        }while(0)

    #define I2C1_TRANSMIT_DATA_MANUAL \
                                        do{       \
                                            I2C1_TRANSMIT_DATA;                   \
                                            /* Wait until byte complete history is cleared */ \
                                            while(I2C1_WAIT_RELEASE_CMD_DONE)     \
                                            {                                                 \
                                            }                                                 \
                                        }while(0)

