land-boards/RasPi/RPI_PSOC5/RPI_PSOC5_RPI_SPI8_CARD_TEST.cydsn/Generated_Source/PSoC5/I2C1.h
    #define I2C1_READY_TO_READ_MANUAL \
                                        do{       \
                                            I2C1_READY_TO_READ;                   \
                                            /* Wait until byte complete history is cleared */ \
                                            while(I2C1_WAIT_RELEASE_CMD_DONE)     \
                                            {                                                 \
                                            }                                                 \
                                        }while(0)

    #define I2C1_ACK_AND_RECEIVE_MANUAL \
                                        do{         \
                                            I2C1_ACK_AND_RECEIVE;                 \
                                            /* Wait until byte complete history is cleared */ \
                                            while(I2C1_WAIT_RELEASE_CMD_DONE)     \
                                            {                                                 \
                                            }                                                 \
                                        }while(0)

    #define I2C1_BUS_RELEASE_MANUAL I2C1_READY_TO_READ_MANUAL

#endif /* (I2C1_FF_IMPLEMENTED) */


/***************************************
*     Default register init constants
***************************************/

#define I2C1_DISABLE    (0u)
#define I2C1_ENABLE     (1u)

#if (I2C1_FF_IMPLEMENTED)
    /* I2C1_XCFG_REG: bits definition */
    #define I2C1_DEFAULT_XCFG_HW_ADDR_EN ((I2C1_HW_ADRR_DECODE) ? \
                                                        (I2C1_XCFG_HDWR_ADDR_EN) : (0u))

    #define I2C1_DEFAULT_XCFG_I2C_ON    ((I2C1_WAKEUP_ENABLED) ? \
                                                        (I2C1_XCFG_I2C_ON) : (0u))


    #define I2C1_DEFAULT_CFG_SIO_SELECT ((I2C1_I2C1_SIO_PAIR) ? \
                                                        (I2C1_CFG_SIO_SELECT) : (0u))


    /* I2C1_CFG_REG: bits definition */
    #define I2C1_DEFAULT_CFG_PSELECT    ((I2C1_WAKEUP_ENABLED) ? \
                                                        (I2C1_CFG_PSELECT) : (0u))

    #define I2C1_DEFAULT_CLK_RATE0  ((I2C1_DATA_RATE <= 50u) ?        \
                                                    (I2C1_CFG_CLK_RATE_050) :     \
                                                    ((I2C1_DATA_RATE <= 100u) ?   \
                                                        (I2C1_CFG_CLK_RATE_100) : \
                                                        (I2C1_CFG_CLK_RATE_400)))

    #define I2C1_DEFAULT_CLK_RATE1  ((I2C1_DATA_RATE <= 50u) ?           \
                                                 (I2C1_CFG_CLK_RATE_LESS_EQUAL_50) : \
                                                 (I2C1_CFG_CLK_RATE_GRATER_50))

    #define I2C1_DEFAULT_CLK_RATE   (I2C1_DEFAULT_CLK_RATE1)


    #define I2C1_ENABLE_MASTER      ((I2C1_MODE_MASTER_ENABLED) ? \
                                                 (I2C1_CFG_EN_MSTR) : (0u))

    #define I2C1_ENABLE_SLAVE       ((I2C1_MODE_SLAVE_ENABLED) ? \
                                                 (I2C1_CFG_EN_SLAVE) : (0u))

    #define I2C1_ENABLE_MS      (I2C1_ENABLE_MASTER | I2C1_ENABLE_SLAVE)


    /* I2C1_DEFAULT_XCFG_REG */
    #define I2C1_DEFAULT_XCFG   (I2C1_XCFG_CLK_EN         | \
                                             I2C1_DEFAULT_XCFG_I2C_ON | \
                                             I2C1_DEFAULT_XCFG_HW_ADDR_EN)

    /* I2C1_DEFAULT_CFG_REG */
    #define I2C1_DEFAULT_CFG    (I2C1_DEFAULT_CFG_SIO_SELECT | \
                                             I2C1_DEFAULT_CFG_PSELECT    | \
                                             I2C1_DEFAULT_CLK_RATE       | \
                                             I2C1_ENABLE_MASTER          | \
                                             I2C1_ENABLE_SLAVE)

    /*I2C1_DEFAULT_DIVIDE_FACTOR_REG */
    #define I2C1_DEFAULT_DIVIDE_FACTOR  ((uint16) 4u)

#else
    /* I2C1_CFG_REG: bits definition  */
    #define I2C1_ENABLE_MASTER  ((I2C1_MODE_MASTER_ENABLED) ? \
                                             (I2C1_CTRL_ENABLE_MASTER_MASK) : (0u))

    #define I2C1_ENABLE_SLAVE   ((I2C1_MODE_SLAVE_ENABLED) ? \
                                             (I2C1_CTRL_ENABLE_SLAVE_MASK) : (0u))

    #define I2C1_ENABLE_MS      (I2C1_ENABLE_MASTER | I2C1_ENABLE_SLAVE)


    #define I2C1_DEFAULT_CTRL_ANY_ADDR   ((I2C1_HW_ADRR_DECODE) ? \
                                                      (0u) : (I2C1_CTRL_ANY_ADDRESS_MASK))

    /* I2C1_DEFAULT_CFG_REG */
    #define I2C1_DEFAULT_CFG    (I2C1_DEFAULT_CTRL_ANY_ADDR)

    /* All CTRL default bits to be used in macro */
    #define I2C1_CTRL_DEFAULT   (I2C1_DEFAULT_CTRL_ANY_ADDR | I2C1_ENABLE_MS)

    /* Master clock generator: d0 and d1 */
    #define I2C1_MCLK_PERIOD_VALUE  (0x0Fu)
    #define I2C1_MCLK_COMPARE_VALUE (0x08u)

    /* Slave bit-counter: control period */
    #define I2C1_PERIOD_VALUE       (0x07u)

    /* I2C1_DEFAULT_INT_MASK */
    #define I2C1_DEFAULT_INT_MASK   (I2C1_BYTE_COMPLETE_IE_MASK)

    /* I2C1_DEFAULT_MCLK_PRD_REG */
    #define I2C1_DEFAULT_MCLK_PRD   (I2C1_MCLK_PERIOD_VALUE)

    /* I2C1_DEFAULT_MCLK_CMP_REG */
    #define I2C1_DEFAULT_MCLK_CMP   (I2C1_MCLK_COMPARE_VALUE)

    /* I2C1_DEFAULT_PERIOD_REG */
    #define I2C1_DEFAULT_PERIOD     (I2C1_PERIOD_VALUE)

#endif /* (I2C1_FF_IMPLEMENTED) */


/***************************************
* The following code is DEPRECATED and
* should not be used in new projects.
***************************************/

#define I2C1_SSTAT_RD_ERR       (0x08u)
#define I2C1_SSTAT_WR_ERR       (0x80u)
#define I2C1_MSTR_SLAVE_BUSY    (I2C1_MSTR_NOT_READY)
#define I2C1_MSTAT_ERR_BUF_OVFL (0x80u)
#define I2C1_SSTAT_RD_CMPT      (I2C1_SSTAT_RD_CMPLT)
#define I2C1_SSTAT_WR_CMPT      (I2C1_SSTAT_WR_CMPLT)
#define I2C1_MODE_MULTI_MASTER_ENABLE    (I2C1_MODE_MULTI_MASTER_MASK)
#define I2C1_DATA_RATE_50       (50u)
#define I2C1_DATA_RATE_100      (100u)
#define I2C1_DEV_MASK           (0xF0u)
#define I2C1_SM_SL_STOP         (0x14u)
#define I2C1_SM_MASTER_IDLE     (0x40u)
#define I2C1_HDWR_DECODE        (0x01u)

#endif /* CY_I2C_I2C1_H */


/* [] END OF FILE */
